World:import("Air_lib.lua")
Air:installMainMenuHandler("DREAM")

-- Kano's route
decisions = {
    -- July 18
    "別の手を考える",
    "走り出す",
    "黙っておく",
    "走り出す",
    "さらに少女に移す",
    "大人しくしておく",
    "大人しく待っておく",
    "反抗してみせる",
    "ごまかす",
    "飲めない",
    "晴子に絡む",
    -- July 19
    "ギブアップ",
    "道を戻る",
    "せがむ",
    "冷蔵庫",
    "無視する",
    "見せない",
    "聞く",
    "お仕置きってなんだ",
    "眠いので寝る",
    -- July 20
    "なわとび",
    "地図の右へ",
    "とりあえず、声をかけてみる",
    "何でもいいから恩を売っておく",
    "バンダナのことを訊いてみる",
    "教えてほしいぞ",
    "無視",
    "やめておく",
    "橋",
    "人形芸を見せてやる",
    "たぶんそうなるだろう",
    "考えておく",
    "断る",
    -- July 21
    "考えておく",
    "ばっちりだ、と答える",
    "書き足してもらう",
    "自力で家を回ることにする",
    "断じて違う",
    -- July 22
    "反撃する",
    "とどめのひと突き",
    "ヒマを持て余している",
    "人形芸を見せてやる",
    "学校へ",
    "興味ない",
    "散歩に出かける",
    "先に進んでみる",
    "様子を見る",
    "どうにか説明する",
    -- July 23
    "代わりのＴシャツを探す",
    "神社",
    "診療所の中",
    "意味もなく間を埋める",
    "駅のほうへ歩いていく",
    "踏みつける",
    -- July 24
    "骨を味わってみる",
    "食べていく",
    -- July 25
    "放っておく",
    "こうなったらとことんつき合う",
    "もう少しからかう",
    "バンダナにはもう触れない",
    -- July 26
    "金を稼ぎに商店街へ",
    "訊いてみる",
    "寝る",
    -- July 28
    "承諾する",
    -- July 29
    "一緒に探してやると言う",
    -- July 30
    "白衣",
    "『このままでは地球に衝突します！』",
    "開けてみる",
    "実は、割と好みだ",
    "まだ盗み聞きをする",
    "まだ聞き耳を立てる",
    -- Aug. 2
    "法術を使って錠前を外す",
    -- Aug 3
    "乗らない",
    "これからも佳乃の側にいる",
    "学校",
    "神社",
}

World:setDecisionList(decisions)
