World:import("Bride_lib.lua")
Bride:installMainMenuHandler()

decisions = {
    "１日目から始める",
    -- 1st Tale
    "兀突骨大王？",
    "親しみを込めてカッちゃん？",
    "じゃ、葛城クン？",
    -- 3rd Tale
    "①　物のない様子。全てを失った様子。",
    "葛城と一緒に炊飯器のスイッチを入れる係",
    "櫻見さん、逢坂さんとポークのオレンジソースを作る",
    -- 6th Tale
    "宿題は自分の力でやるべき",
    "今度だけ見せてあげたら？",
    -- 7th Tale
    "受けない",
    -- 8th Tale
    "受けない",
    "フライドチキン",
    "家計簿をつける",
    "とにかく聖ちゃんを脱出させる",
    "③　子供の遊戯。けんけん。",
    "葛城と櫻見さんと調味料を買いに",
    "うん、上手に出来てる",
    "櫻見さんの部屋に行く",
    "あわてて電話を切る",
    "先を譲る",
    -- 9th Tale
    "水族館",
    "櫻見さんの部屋に行く",
    "クッキーはおいしかった？",
    "たしなめる",
    -- 10th Tale
    "受ける",
    -- 12th Tale
    "受けない",
    -- 13th Tale
    "受ける",
    "櫻見さん",
    "渡す"
}

World:setDecisionList(decisions)
