World:import("LB_lib.lua")
LB:installMainMenuHandler()
LB:clickThroughMinigames()

-- Komari Kamikita
-- Adapted from http://gamerssquare.kanpaku.jp/littlebusters.htm#r4
decisions = {
    -- May 14th
    "しばらく見守る",
    "よくない",
    "よくない",
    "よくない",
    "よくない",
    -- May 15th
    "貸す",
    "探しに行く",
    "しばらく見守る",
    -- May 16th
    "鈴を追う",
    "しばらく見守る",
    "ＱＲコードを携帯で読み込んでおく",
    "引き受ける",
    "巻き込まれる",
    "練習を続ける",
    "見つけるのを手伝う",
    -- May 17th
    "探してみる",
    "黙ってみてる",
    "携帯サイトにアクセスする",
    "次を読む", --　※ランダムで内容が変わる。好きなだけ”次を読む”を選んでも可
    "自習に戻る",
    "鈴を追う",
    "しばらく見守る",
    "屋上にいく",
    --※佐々美と対戦
    -- May 18th
    "鈴",
    "しばらく見守る", -- ※配膳ミッション
    "中庭に残る",
    "何訊いてたの？",
    "ジュースを買いに行く",
    "引き受ける",
    "やめさせる",
    -- ※謎の生命体戦。敗北でOK
    -- May 19th
    "鈴を探す",
    "しばらく見守る",
    "やっぱり気になる",
    "表に出る",
    "手伝う",
    "首をつっこむ",
    "中庭",
    "練習を続ける",
    "手伝う",
    -- May 20th
    "いく",
    "来ヶ谷",
    "チョコストライプのドーナツ",
    -- May 21st
    "しっかり読む",
    "ジュースを買いに行く",
    "練習に向かう",
    "練習を続ける",
    "小毬",
    -- May 22nd
    "ここが僕の家", -- ※表示されない
    "呼びにいかない",
    "教室に戻る",
    "裏庭にいく",
    "恭介を追う",
    "何を話しているか聞きにいく",
    "クドに首を振った",
    "いく",
    -- May 23rd
    "教室に入る",
    "しばらく見守る",
    "やめさせる",
    "屋上にいく",
    "ジュースを買いに行く",
    "何を話しているか聞きにいく",
    "放っておく",
    "話しかける",
    "とめる",
    "恭介の部屋にいく",
    "みんなを呼ぶ",
    -- May 24th
    "ジュースを買いに行く",
    "手伝う",
    "教室に戻る",
    "何を話しているか聞きにいく",
    "小毬",
    "美魚",
    -- May 25th
    "これで決定",
    "廊下を走り抜ける",
    "断る",
    "終わりにする",
    "ジョー",
    "エイリアン",
    -- May 28th
    "屋上にいく",
    -- 小毬
    "恭介にメールを出す",
    "ネットを探す",
    "直す",
    "夢について訊く",
    "恭介に訊く",
    "真正面から向き合わなきゃいけない"

    -- TODO: Need to inject a click here.
}

World:setDecisionList(decisions)
