World:import("LB_lib.lua")
LB:installMainMenuHandler()
LB:clickThroughMinigames()
LB:installRandomDecisionHandler()

-- Rin (bad ending)
-- Adapted from http://gamerssquare.kanpaku.jp/littlebusters.htm#r3
decisions = {
    -- May 14th
    "しばらく見守る",
    "よくない",
    "よくない",
    "よくない",
    "よくない",
    -- May 15th
    "貸す",
    "探しに行く",
    "しばらく見守る",
    -- May 16th
    "鈴を追う",
    "しばらく見守る",
    "ＱＲコードを携帯で読み込んでおく",
    "引き受ける",
    "巻き込まれる",
    "練習を続ける",
    "見つけるのを手伝う",
    -- May 17th
    "探してみる",
    "黙ってみてる",
    "携帯サイトにアクセスする",
    "次を読む", --　※ランダムで内容が変わる。好きなだけ”次を読む”を選んでも可
    "自習に戻る",
    "鈴を追う",
    "しばらく見守る",
    "屋上にいく",
    --※佐々美と対戦
    -- May 18th
    "鈴",
    "しばらく見守る", -- ※配膳ミッション
    "中庭に残る",
    "何訊いてたの？",
    "ジュースを買いに行く",
    "引き受ける",
    "やめさせる",
    -- ※謎の生命体戦。敗北でOK
    -- May 19th
    "鈴を探す",
    "しばらく見守る",
    "やっぱり気になる",
    "表に出る",
    "手伝う",
    "首をつっこむ",
    "中庭",
    "練習を続ける",
    "手伝う",
    -- May 20th
    "いく",
    "来ヶ谷",
    "チョコストライプのドーナツ",
    -- May 21st
    "しっかり読む",
    "ジュースを買いに行く",
    "練習に向かう",
    "練習を続ける",
    "来ヶ谷",
    -- May 22nd
    "ここが僕の家",
    "呼びにいく",
    "真人と遊ぶ",
    "裏庭にいく",
    "耳を澄ませてみる",
    "恭介を追う",
    "何を話しているか聞きにいく",
    "クドに首を振った",
    "いく",
    -- May 23rd
    "教室に入る",
    "しばらく見守る",
    "手伝い続ける",
    -- Three timed choices here.
    "真人と遊ぶ",
    "練習に集中",
    "練習",
    "放っておく",
    "学食に急ぐ",
    "おかわりする",
    "恭介の部屋にいく",
    "みんなを呼ぶ",
    -- May 24th
    "真人と遊ぶ",
    "猫を探してみる",
    "練習に集中",
    -- script breaks around here. The next two options don't appear.
    -- "鈴",
    -- "小毬",
    -- "ジョー",
    -- "エイリアン",
    -- May 25th
    "鈴に相談",
    "廊下を走り抜ける",
    "助けてもらう",
    "終わりにする",
    -- 鈴
    "励ます",
    "挙手する"
}

World:setDecisionList(decisions)

LB:handleTimedChoices({"邪魔だろ！！",
                       "そこまででかくなるか！！",
                       "みんなの服に飛び散っただろ！！"})
