World:import("LB_lib.lua")
LB:installMainMenuHandler()
LB:clickThroughMinigames()
LB:installRandomDecisionHandler()

-- Saigusa's path. Copied and reworked from
-- http://gamerssquare.kanpaku.jp/littlebusters.htm#r7
decisions = {
    -- May 14th
    "しばらく見守る",
    "よくない",
    "よくない",
    "よくない",
    "よくない",
    -- May 15th
    "貸す",
    "探しに行く",
    "しばらく見守る",
    -- May 16th
    "鈴を追う",
    "しばらく見守る",
    "ＱＲコードを携帯で読み込んでおく",
    "引き受ける",
    "巻き込まれる",
    "練習を続ける",
    "見つけるのを手伝う",
    -- May 17th
    "探してみる",
    "黙ってみてる",
    "携帯サイトにアクセスする",
    "次を読む", --　※ランダムで内容が変わる。好きなだけ”次を読む”を選んでも可
    "自習に戻る",
    "鈴を追う",
    "しばらく見守る",
    "屋上にいく",
    --※佐々美と対戦
    -- May 18th
    "鈴",
    "しばらく見守る", -- ※配膳ミッション
    "中庭に残る",
    "何訊いてたの？",
    "ジュースを買いに行く",
    "引き受ける",
    "やめさせる",
    -- ※謎の生命体戦。敗北でOK
    -- May 19th
    "鈴を探す",
    "しばらく見守る",
    "やっぱり気になる",
    "表に出る",
    "手伝う",
    "首をつっこむ",
    "中庭",
    "練習を続ける",
    "手伝う",
    -- May 20th
    "いく",
    "来ヶ谷",
    "ベーシックなドーナツ",
    -- May 21st
    "軽く読む",
    "真人と遊ぶ",
    "練習に向かう",
    "練習を続ける",
    "葉留佳",
    -- May 22nd
    "例のやつが出た", --※表示されない
    "真人と遊ぶ",
    "学食にいく",
    "先にいく",
    "葉留佳さん",
    "恭介を追う",
    "何を話しているか聞きにいく",
    "クドに首を振った",
    "いく",
    -- 5/23
    "教室に入る",
    "しばらく見守る",
    "やめさせる",
    "学食にいく",
    "手伝う",
    "真人と遊ぶ",
    "何を話しているか聞きにいく",
    "掃除する",
    "学食に急ぐ",
    "やめておく",
    "恭介の部屋にいく",
    "みんなを呼ぶ",
    -- May 24th
    "ジュースを買いに行く",
    "見送る",
    "猫を探してみる",
    "何を話しているか聞きにいく",
    "葉留佳",
    "クド",
    -- May 25th
    "これで決定",
    "廊下を走り抜ける",
    "断る",
    "練習を続ける",
    "練習を続ける",
    "ジョー",
    "エイリアン",
    -- May 28th
    "中庭の自動販売機",
    "どうしたのか訊く",
    -- 葉留佳
    "委員会室へ向かう",
    "本当か訊く",
    "確認する",
    "葉留佳さん探しを続行する",
    "名簿で見たと答える",
    "うん",
    "わかりました",
    "いいと思う", --　※反対の選択肢でBADエンド
    "ブルーベリーとか",
    "条件をのむ",
    "諦めない"
}

World:setDecisionList(decisions)
